---
kind: property
id: P:Autodesk.Revit.DB.RevolvedFace.Radius(System.Int32)
source: html/e1acc702-3dcf-3972-b2d9-a297c3e165f3.htm
---
# Autodesk.Revit.DB.RevolvedFace.Radius Property

Radius of the surface.

## Syntax (C#)
```csharp
public XYZ this[
	int index
] { get; }
```

## Parameters
- **index** (`System.Int32`)